spec/fixtures/files/gtn_generic_invoice.xml

<Invoice>
  <header>
    <version>310</version>
    <documentType>Invoice</documentType>
    <messageId>2256417566</messageId>
    <count>1</count>
  </header>
  <invoiceDetail>
    <subMessageId>1</subMessageId>
    <subscriptionEvent>
      <eventTypeCode>ExportEvent</eventTypeCode>
      <eventRoleCode>MessageExporter</eventRoleCode>
      <eventDate>2018-08-24</eventDate>
      <eventDateTime>2018-08-24T06:45:12Z</eventDateTime>
    </subscriptionEvent>
    <redirectUrl>https://network.gtnexus.com/en/trade/CommercialInvoice?key=63483829567</redirectUrl>
    <invoiceNumber>EEGC/7469/1819</invoiceNumber>
    <invoiceUid>63483829566</invoiceUid>
    <invoiceTypeCode>Commercial</invoiceTypeCode>
    <invoiceFunctionCode>Create</invoiceFunctionCode>
    <invoiceTerms>
      <invoiceDate>
        <invoiceDateTypeCode>Issue</invoiceDateTypeCode>
        <invoiceDateValue>2018-08-06</invoiceDateValue>
      </invoiceDate>
      <invoiceDate>
        <invoiceDateTypeCode>ExFactory</invoiceDateTypeCode>
        <invoiceDateValue>2018-07-07</invoiceDateValue>
      </invoiceDate>
      <incotermCode>FOB</incotermCode>
      <incotermLocationCode>INMAA</incotermLocationCode>
      <shipmentMethodCode>A</shipmentMethodCode>
      <currencyCode>USD</currencyCode>
      <isCovered>false</isCovered>
      <shipmentTracking>
        <portOfLoadingCode>MAA</portOfLoadingCode>
        <portOfDischargeCityCode>MAA</portOfDischargeCityCode>
        <vesselName>TBC</vesselName>
        <voyageOrFlightNumber>TBC</voyageOrFlightNumber>
        <actualShipmentDate>2018-08-09</actualShipmentDate>
        <estimatedArrivalDate>2018-08-20</estimatedArrivalDate>
      </shipmentTracking>
      <packageDimensionSummary>
        <totalPackageQuantity>403</totalPackageQuantity>
        <weightUnitCode>KG</weightUnitCode>
        <totalGrossWeight>766.846</totalGrossWeight>
        <totalNetWeight>608.357</totalNetWeight>
        <totalNetNetWeight>553.297</totalNetNetWeight>
        <volumeUnitCode>CR</volumeUnitCode>
        <totalGrossVolume>5.445</totalGrossVolume>
      </packageDimensionSummary>
      <freightPaymentCode>CC</freightPaymentCode>
    </invoiceTerms>
    <party>
      <partyRoleCode>Buyer</partyRoleCode>
      <memberId>5717988960002119</memberId>
      <divisionUid>82685</divisionUid>
      <!-- JH NOTE : There can actually be hundreds of these identification elements...I trimmed most out from the sample given. -->
      <identification>
        <type>PVH_Buyer_Party_ID</type>
        <value>FBTFE</value>
      </identification>
      <name>PVH Canada, Inc.</name>
      <contact>
        <name>arober</name>
        <department>TC</department>
      </contact>
      <address>
        <addressLine1>555 Richmond Street</addressLine1>
        <city>Toronto</city>
        <stateOrProvince>ON</stateOrProvince>
        <postalCodeNumber>M5V 3B1</postalCodeNumber>
        <countryCode>CA</countryCode>
      </address>
      <reference>
        <type>BuyerCode</type>
        <value>BTTC</value>
      </reference>
      <reference>
        <type>UNLocode</type>
        <value>CATOR</value>
      </reference>
    </party>
    <party>
      <partyRoleCode>Seller</partyRoleCode>
      <memberId>5717989018071001</memberId>
      <!-- JH NOTE : There can actually be hundreds of these identification elements...I trimmed most out from the sample given. -->
      <identification>
        <type>PVH_Seller_Party_ID</type>
        <value>M009940001</value>
      </identification>
      <name>EASTMAN EXPORTS GLOBAL-</name>
      <contact>
        <name>G. Ramaswamy</name>
      </contact>
      <address>
        <addressLine1>5/591 SRI LAKSHMI NAGAR</addressLine1>
        <addressLine2>PITCHAMPALAYAM PUDUR, TIRUPUR</addressLine2>
        <city>TAMILNADU</city>
        <postalCodeNumber>641603</postalCodeNumber>
        <countryCode>IN</countryCode>
      </address>
      <reference>
        <type>VendorNumber</type>
        <value>23894</value>
      </reference>
      <reference>
        <type>LawsonNumber</type>
        <value>7173133</value>
      </reference>
      <reference>
        <type>Vendor Number</type>
        <value>7173133</value>
      </reference>
      <reference>
        <type>UNLocode</type>
        <value>INTUP</value>
      </reference>
    </party>
    <party>
      <partyRoleCode>BuyersAgent</partyRoleCode>
      <memberId>5717988960036332</memberId>
      <!-- JH NOTE : There can actually be hundreds of these identification elements...I trimmed most out from the sample given. -->
      <identification>
        <type>PVH_Agent_Party_ID</type>
        <value>LF-SHAA</value>
      </identification>
      <identification>
        <type>PVH_Agent_Party_ID</type>
        <value>LF-SHANGHA</value>
      </identification>
      <identification>
        <type>PVH_Agent_Party_ID</type>
        <value>90066</value>
      </identification>
      <name>LF CENTENNIAL PTE LTD</name>
      <address>
        <addressLine1>10, RAEBURN PARK,|#03-08, BLOCK A</addressLine1>
        <city>SINGAPORE</city>
        <postalCodeNumber>088702</postalCodeNumber>
        <countryCode>SG</countryCode>
      </address>
      <reference>
        <type>BuyersAgentCode</type>
        <value>LF-CEN</value>
      </reference>
    </party>
    <party>
      <partyUid>63480155067</partyUid>
      <partyRoleCode>LogisticsProvider</partyRoleCode>
      <memberId>5717989018169477</memberId>
      <!-- JH NOTE : There can actually be hundreds of these identification elements...I trimmed most out from the sample given. -->
      <identification>
        <type>PVH_LSP_Party_ID</type>
        <value>SGTDHL</value>
      </identification>
      <identification>
        <type>LogisticsProvider</type>
        <value>SEAGATE</value>
      </identification>
      <identification>
        <type>SCAC</type>
        <value>SGTA</value>
      </identification>
      <identification>
        <type>PVH_LSP_Party_ID</type>
        <value>SEAGATE</value>
      </identification>
      <name>Seagate Logistics</name>
      <address>
        <addressUid>63480155067</addressUid>
        <addressLine1>64 North Central Avenue</addressLine1>
        <city>Valley Stream</city>
        <stateOrProvince>NY</stateOrProvince>
        <postalCodeNumber>11580</postalCodeNumber>
        <countryCode>US</countryCode>
      </address>
    </party>
    <party>
      <partyRoleCode>OriginOfGoods</partyRoleCode>
      <memberId>5717989018167283</memberId>
      <identification>
        <type>PVH_OOG_Party_ID</type>
        <value>M009940092</value>
      </identification>
      <identification>
        <type>PVH_OOG_Party_ID</type>
        <value>25352</value>
      </identification>
      <identification>
        <type>PVH_OOG_Party_ID</type>
        <value>23894509</value>
      </identification>
      <name>RODAMINE APPAREL INDUSTRIES (P) LTD</name>
      <address>
        <addressLine1>SHED NO H1 &#38; H2|NETHAJI APPAREL PARK</addressLine1>
        <addressLine2>EETTIVEERAMPALAYAM</addressLine2>
        <city>TIRUPPUR</city>
        <countryCode>IN</countryCode>
      </address>
    </party>
    <party>
      <partyUid>63480155069</partyUid>
      <partyRoleCode>Consignee</partyRoleCode>
      <name>PVH CANADA, INC.</name>
      <address>
        <addressUid>63480155069</addressUid>
        <addressLine1>555 Richmond Street</addressLine1>
        <city>Toronto,</city>
        <stateOrProvince>ON</stateOrProvince>
        <postalCodeNumber>M5V 3B1</postalCodeNumber>
        <countryCode>CA</countryCode>
      </address>
      <reference>
        <type>ConsigneeCode</type>
        <value>CNTC</value>
      </reference>
      <reference>
        <type>UNLocode</type>
        <value>CATOR</value>
      </reference>
    </party>
    <party>
      <partyRoleCode>ShipmentDestination</partyRoleCode>
      <name>PVH Canada, Inc. 55</name>
      <address>
        <addressLine1>7445 Cote-de Liesse</addressLine1>
        <city>Montreal, QC</city>
        <postalCodeNumber>H4T 1G2</postalCodeNumber>
        <countryCode>CA</countryCode>
      </address>
    </party>
    <invoiceItem>
      <poNumber>RTTC216384</poNumber>
      <itemKey>001</itemKey>
      <baseItem>
        <itemUid>1874746375</itemUid>
        <itemTypeCode>Main</itemTypeCode>
        <itemIdentifier>
          <itemIdentifierTypeCode>ItemSequenceNumber</itemIdentifierTypeCode>
          <itemIdentifierValue>001</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>BuyerNumber</itemIdentifierTypeCode>
          <itemIdentifierValue>7695775</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>ShortDescription</itemIdentifierTypeCode>
          <itemIdentifierValue>W CROSSED TH TEE TEE-112-</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>UpcNumber</itemIdentifierTypeCode>
          <itemIdentifierValue>421806800159</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>CountryOfOrigin</itemIdentifierTypeCode>
          <itemIdentifierValue>IN</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>QuotaCategory</itemIdentifierTypeCode>
          <itemIdentifierValue>888</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>IdBuyerColor</itemIdentifierTypeCode>
          <itemIdentifierValue>900</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>IdEANUCC8</itemIdentifierTypeCode>
          <itemIdentifierValue>421806800159</itemIdentifierValue>
        </itemIdentifier>
        <itemDescriptor>
          <itemDescriptorTypeCode>LongDescription</itemDescriptorTypeCode>
          <itemDescriptorValue>52% COTTON 48% MODAL KNITTED LADIES T.SHIRT</itemDescriptorValue>
        </itemDescriptor>
        <itemDescriptor>
          <itemDescriptorTypeCode>DescBuyerColor</itemDescriptorTypeCode>
          <itemDescriptorValue>BRIGHT WHITE</itemDescriptorValue>
        </itemDescriptor>
        <customsClassification>
          <classificationNumber>6109100022</classificationNumber>
        </customsClassification>
        <!-- These reference values are customer specific...each GTN implementation (customer) will have different values -->
        <reference>
          <type>RetailCostPrice</type>
        </reference>
        <reference>
          <type>Dimension</type>
        </reference>
        <quantity>324</quantity>
        <unitOfMeasureCode>EA</unitOfMeasureCode>
        <packageInstruction>
          <packInstructionReference>001</packInstructionReference>
          <quantityPerOuterPackage>1</quantityPerOuterPackage>
        </packageInstruction>
        <itemDate>
          <itemDateTypeCode>PromisedDelivery</itemDateTypeCode>
          <itemDateValue>2018-08-07T00:00:00Z</itemDateValue>
        </itemDate>
        <shipmentMethodCode>A</shipmentMethodCode>
        <party>
          <partyRoleCode>ShipmentDestination</partyRoleCode>
          <name>PVH Canada, Inc. 55</name>
        </party>
        <party>
          <partyRoleCode>OriginOfGoods</partyRoleCode>
          <name>RODAMINE APPAREL INDUSTRIES (P) LTD</name>
        </party>
      </baseItem>
      <itemPrice>
        <pricePerUnit>5.84</pricePerUnit>
        <totalPrice>1892.16</totalPrice>
      </itemPrice>
      <invoiceItem>
        <poNumber>RTTC216384</poNumber>
        <itemKey>001-00002</itemKey>
        <baseItem>
          <itemUid>1874746376</itemUid>
          <itemTypeCode>Sub</itemTypeCode>
          <itemIdentifier>
            <itemIdentifierTypeCode>ItemSequenceNumber</itemIdentifierTypeCode>
            <itemIdentifierValue>001-00002</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>BuyerNumber</itemIdentifierTypeCode>
            <itemIdentifierValue>7695775</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>UpcNumber</itemIdentifierTypeCode>
            <itemIdentifierValue>638950017382</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>IdBuyerColor</itemIdentifierTypeCode>
            <itemIdentifierValue>112</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>IdBuyerSize</itemIdentifierTypeCode>
            <itemIdentifierValue>XXS</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>IdEANUCC8</itemIdentifierTypeCode>
            <itemIdentifierValue>638950017382</itemIdentifierValue>
          </itemIdentifier>
          <itemDescriptor>
            <itemDescriptorTypeCode>LongDescription</itemDescriptorTypeCode>
            <itemDescriptorValue>W CROSSED TH TEE TEE</itemDescriptorValue>
          </itemDescriptor>
          <itemDescriptor>
            <itemDescriptorTypeCode>DescBuyerColor</itemDescriptorTypeCode>
            <itemDescriptorValue>BRIGHT WHITE</itemDescriptorValue>
          </itemDescriptor>
          <reference>
            <type>Dimension</type>
          </reference>
          <reference>
            <type>BoxEndCode</type>
            <value>20638950017386</value>
          </reference>
          <quantity>324</quantity>
          <unitOfMeasureCode>EA</unitOfMeasureCode>
          <packageInstruction>
            <quantityPerInnerPackage>1</quantityPerInnerPackage>
          </packageInstruction>
          <shipmentMethodCode>A</shipmentMethodCode>
        </baseItem>
        <itemPrice>
          <pricePerUnit>5.84</pricePerUnit>
          <totalPrice>1892.16</totalPrice>
          <pricing>
            <priceTypeCode>PriceRTL</priceTypeCode>
            <priceValue>39.99</priceValue>
            <currencyCode>USD</currencyCode>
          </pricing>
        </itemPrice>
      </invoiceItem>
    </invoiceItem>
    <invoiceItem>
      <poNumber>RTTC216383</poNumber>
      <itemKey>002</itemKey>
      <baseItem>
        <itemUid>1874746382</itemUid>
        <itemTypeCode>Main</itemTypeCode>
        <itemIdentifier>
          <itemIdentifierTypeCode>ItemSequenceNumber</itemIdentifierTypeCode>
          <itemIdentifierValue>002</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>BuyerNumber</itemIdentifierTypeCode>
          <itemIdentifierValue>7695775</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>ShortDescription</itemIdentifierTypeCode>
          <itemIdentifierValue>W CROSSED TH TEE TEE-112-</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>UpcNumber</itemIdentifierTypeCode>
          <itemIdentifierValue>421809300144</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>CountryOfOrigin</itemIdentifierTypeCode>
          <itemIdentifierValue>IN</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>QuotaCategory</itemIdentifierTypeCode>
          <itemIdentifierValue>888</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>IdBuyerColor</itemIdentifierTypeCode>
          <itemIdentifierValue>902</itemIdentifierValue>
        </itemIdentifier>
        <itemIdentifier>
          <itemIdentifierTypeCode>IdEANUCC8</itemIdentifierTypeCode>
          <itemIdentifierValue>421809300144</itemIdentifierValue>
        </itemIdentifier>
        <itemDescriptor>
          <itemDescriptorTypeCode>LongDescription</itemDescriptorTypeCode>
          <itemDescriptorValue>52% COTTON 48% MODAL KNITTED LADIES T.SHIRT</itemDescriptorValue>
        </itemDescriptor>
        <itemDescriptor>
          <itemDescriptorTypeCode>DescBuyerColor</itemDescriptorTypeCode>
          <itemDescriptorValue>BRIGHT WHITE</itemDescriptorValue>
        </itemDescriptor>
        <customsClassification>
          <classificationNumber>6109100022</classificationNumber>
        </customsClassification>
        <!-- These reference values are customer specific...each GTN implementation (customer) will have different values -->
        <reference>
          <type>RetailCostPrice</type>
        </reference>
        <reference>
          <type>Dimension</type>
        </reference>
        <quantity>288</quantity>
        <unitOfMeasureCode>EA</unitOfMeasureCode>
        <packageInstruction>
          <packInstructionReference>002</packInstructionReference>
          <quantityPerOuterPackage>1</quantityPerOuterPackage>
        </packageInstruction>
        <itemDate>
          <itemDateTypeCode>PromisedDelivery</itemDateTypeCode>
          <itemDateValue>2018-08-07T00:00:00Z</itemDateValue>
        </itemDate>
        <shipmentMethodCode>A</shipmentMethodCode>
        <party>
          <partyRoleCode>ShipmentDestination</partyRoleCode>
          <name>PVH Canada, Inc. 55</name>
        </party>
        <party>
          <partyRoleCode>OriginOfGoods</partyRoleCode>
          <name>RODAMINE APPAREL INDUSTRIES (P) LTD</name>
        </party>
      </baseItem>
      <itemPrice>
        <pricePerUnit>5.84</pricePerUnit>
        <totalPrice>1681.92</totalPrice>
      </itemPrice>
      <invoiceItem>
        <poNumber>RTTC216384</poNumber>
        <itemKey>002-00002</itemKey>
        <baseItem>
          <itemUid>1874746383</itemUid>
          <itemTypeCode>Sub</itemTypeCode>
          <itemIdentifier>
            <itemIdentifierTypeCode>ItemSequenceNumber</itemIdentifierTypeCode>
            <itemIdentifierValue>002-00002</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>BuyerNumber</itemIdentifierTypeCode>
            <itemIdentifierValue>7695775</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>UpcNumber</itemIdentifierTypeCode>
            <itemIdentifierValue>638950017382</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>IdBuyerColor</itemIdentifierTypeCode>
            <itemIdentifierValue>112</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>IdBuyerSize</itemIdentifierTypeCode>
            <itemIdentifierValue>XXS</itemIdentifierValue>
          </itemIdentifier>
          <itemIdentifier>
            <itemIdentifierTypeCode>IdEANUCC8</itemIdentifierTypeCode>
            <itemIdentifierValue>638950017382</itemIdentifierValue>
          </itemIdentifier>
          <itemDescriptor>
            <itemDescriptorTypeCode>LongDescription</itemDescriptorTypeCode>
            <itemDescriptorValue>W CROSSED TH TEE TEE</itemDescriptorValue>
          </itemDescriptor>
          <itemDescriptor>
            <itemDescriptorTypeCode>DescBuyerColor</itemDescriptorTypeCode>
            <itemDescriptorValue>BRIGHT WHITE</itemDescriptorValue>
          </itemDescriptor>
          <!-- These reference values are customer specific...each GTN implementation (customer) will have different values -->
          <reference>
            <type>Dimension</type>
          </reference>
          <reference>
            <type>BoxEndCode</type>
            <value>20638950017386</value>
          </reference>
          <quantity>288</quantity>
          <unitOfMeasureCode>EA</unitOfMeasureCode>
          <packageInstruction>
            <quantityPerInnerPackage>1</quantityPerInnerPackage>
          </packageInstruction>
          <shipmentMethodCode>A</shipmentMethodCode>
        </baseItem>
        <itemPrice>
          <pricePerUnit>5.84</pricePerUnit>
          <totalPrice>1081.92</totalPrice>
          <pricing>
            <priceTypeCode>PriceRTL</priceTypeCode>
            <priceValue>39.99</priceValue>
            <currencyCode>USD</currencyCode>
          </pricing>
        </itemPrice>
      </invoiceItem>
    </invoiceItem>
    <invoiceTotals>
      <totalQuantity>612</totalQuantity>
      <totalMerchandiseAmount>3574.08</totalMerchandiseAmount>
      <totalAllowanceChargeAmount>0.00</totalAllowanceChargeAmount>
      <totalTaxAmount>0.00</totalTaxAmount>
      <totalDocumentAmount>3574.08</totalDocumentAmount>
    </invoiceTotals>
  </invoiceDetail>
</Invoice>